#Область ПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт

    ЮТТесты
        .ДобавитьТест("СложениеБезПараметров")
        .ДобавитьТест("СложениеСПараметрами")
            .СПараметрами(2, 3, 5)
            .СПараметрами(2, -3, -1)
            .СПараметрами("2", "-3", "2-3")
            .СПараметрами("2", -3, "2-3")
        .ДобавитьТест("ВычитаниеБезПараметров")
        .ДобавитьТест("ВычитаниеСПараметрами")
            .СПараметрами(5, 3, 2)
            .СПараметрами(2, -3, 5)
            .СПараметрами(-3, -3, 0)
            .СПараметрами("5", "3", 2)
        ;

КонецПроцедуры

Процедура СложениеБезПараметров() Экспорт

    РезультатСложения = 2 + 2;
    ЮТест.ОжидаетЧто(РезультатСложения)
        .Равно(4);

КонецПроцедуры

Процедура СложениеСПараметрами(ПервыйОперанд, ВторойОперанд, Результат) Экспорт

    РезультатСложения = ПервыйОперанд + ВторойОперанд;
    ЮТест.ОжидаетЧто(РезультатСложения)
        .Равно(Результат);

КонецПроцедуры

Процедура ВычитаниеБезПараметров() Экспорт

    РезультатВычитания = 10 - 4;
    ЮТест.ОжидаетЧто(РезультатВычитания)
        .Равно(6);

КонецПроцедуры

Процедура ВычитаниеСПараметрами(ПервыйОперанд, ВторойОперанд, Результат) Экспорт

    РезультатВычитания = ПервыйОперанд - ВторойОперанд;
    ЮТест.ОжидаетЧто(РезультатВычитания)
        .Равно(Результат);

КонецПроцедуры

#КонецОбласти
