#language: ru

@tree

Функционал: НСИ

Как Администратор я хочу
выполнить создание и запись контрагентов
чтобы <бизнес-эффект> 

Сценарий: Запись справочника "Контрагенты" 
И В командном интерфейсе я выбираю "Закупки" "Контрагенты"
Тогда открылось окно "Контрагенты"
И я нажимаю на кнопку с именем 'ФормаСоздать'
Тогда открылось окно "Контрагент (создание)"
И в поле с именем 'Наименование' я ввожу текст "Тестирование"
И из выпадающего списка с именем 'ВидЦен' я выбираю точное значение "Закупочная"
И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
И я жду закрытия окна "Контрагент (создание)*" в течение 3 секунд

Сценарий: Проверка корретности заполнения электронной почты справочника "Контрагенты" 
И В командном интерфейсе я выбираю "Закупки" "Контрагенты"
Тогда открылось окно "Контрагенты"
И я нажимаю на кнопку с именем 'ФормаСоздать'
Тогда открылось окно "Контрагент (создание)"
И в поле с именем 'Наименование' я ввожу текст "Тестирование"
И из выпадающего списка с именем 'ВидЦен' я выбираю точное значение "Закупочная"
И в поле с именем 'ЭлектроннаяПочта' я ввожу текст "НекоретнаяПочта"
И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
И я сохраняю текст сообщения в переменную 'ТекстСообщения'
Тогда в логе сообщений TestClient есть строка 'Введен некорректный адрес электронной почты!'
И Я закрываю окно "Контрагент (создание)*"
Тогда открылось окно "1С:Предприятие"
И я нажимаю на кнопку с именем 'Button1'







