#language: ru

@tree

Функционал: Продажи

Как Администратор я хочу
Создаить и проверсти документ "Расход товара" и проверить, что остатки не списваеются в минус 
чтобы <бизнес-эффект>   

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: Создание и проведение документа "Расход товара" с отствующей номенклатурой на складе
И В командном интерфейсе я выбираю "Предприятие" "Организации"
Тогда открылось окно "Организации"
И я нажимаю на кнопку с именем 'ФормаСоздать'
Тогда открылось окно "Организация (создание)"
И в поле с именем 'Наименование' я ввожу текст "Тестирование"
И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
И я жду закрытия окна "Организация (создание)*" в течение 5 секунд

Когда В командном интерфейсе я выбираю "Товарные запасы" "Товары"
Тогда открылось окно "Товары"
И я нажимаю на кнопку с именем 'ФормаСоздать'
Тогда открылось окно "Товар (создание)"
И в поле с именем 'Наименование' я ввожу текст "Тестирование"
И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
И я жду закрытия окна "Товар (создание)*" в течение 5 секунд

И В командном интерфейсе я выбираю "Продажи" "Контрагенты"
Тогда открылось окно "Контрагенты"
И я нажимаю на кнопку с именем 'ФормаСоздать'
Тогда открылось окно "Контрагент (создание)"
И в поле с именем 'Наименование' я ввожу текст "Тестирование"
И из выпадающего списка с именем 'ВидЦен' я выбираю точное значение "Закупочная"
И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
И я жду закрытия окна "Контрагент (создание)*" в течение 5 секунд

И В командном интерфейсе я выбираю "Продажи" "Документы продаж"
Тогда открылось окно "Документы продаж"
И я нажимаю на кнопку с именем 'ФормаСоздатьПоПараметруРасходТовара'
Тогда открылось окно "Продажа товара (создание)"
И я нажимаю кнопку выбора у поля с именем 'Организация'
И из выпадающего списка с именем 'Организация' я выбираю по строке "Тестирование"
И из выпадающего списка с именем 'Покупатель' я выбираю по строке "Тестирование"
И в таблице 'Товары' я нажимаю на кнопку с именем 'ТоварыДобавить'
И в таблице 'Товары' из выпадающего списка с именем 'ТоварыТовар' я выбираю по строке "Тестирование"
И в таблице 'Товары' я активизирую поле с именем 'ТоварыЦена'
И в таблице 'Товары' в поле с именем 'ТоварыЦена' я ввожу текст "1,00"
И в таблице 'Товары' я активизирую поле с именем 'ТоварыКоличество'
И в таблице 'Товары' в поле с именем 'ТоварыКоличество' я ввожу текст "1,00"
И в таблице 'Товары' я активизирую поле с именем 'ТоварыСумма'
И в таблице 'Товары' в поле с именем 'ТоварыСумма' я ввожу текст "1,00"
И в таблице 'Товары' я завершаю редактирование строки
И я нажимаю на кнопку с именем 'ФормаПровести'
Тогда открылось окно "1С:Предприятие"
И элемент формы с именем 'ErrorInfo' стал равен "Не удалось провести: \"Продажа товара\"!"


